---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalCurveType.RigidLinkHead
enum: Autodesk.Revit.DB.Structure.AnalyticalCurveType
source: html/2c102724-4c8b-e648-31da-31fb383801fb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalCurveType.RigidLinkHead

Rigid Link at end 0 (head) of the Beam.